STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_sd.c
/* Private function prototypes -----------------------------------------------*/
/** @defgroup STM32G0C1E_EVAL_SD_Private_Functions Private Functions
* @{
*/
static uint8_t SD_GetCIDRegister(SD_CID* Cid);
static uint8_t SD_GetCSDRegister(SD_CSD* Csd);
static uint8_t SD_GetDataResponse(void);
static uint8_t SD_GoIdleState(void);
static SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer);
static uint8_t SD_WaitData(uint8_t data);
static uint8_t SD_ReadData(void);
/**
* @}
*/

/* Exported functions ---------------------------------------------------------*/

/** @addtogroup STM32G0C1E_EVAL_SD_Exported_Functions
* @{
*/

/**
  * @brief  Initializes the SD/SD communication.
  * @retval The SD Response:
  *         - MSD_ERROR: Sequence failed
  *         - MSD_OK: Sequence succeed
  */
uint8_t BSP_SD_Init(void)
{
    /* Configure IO functionalities for SD pin */
    SD_IO_Init();

    /* Check SD card detect pin */
    if(BSP_SD_IsDetected()==SD_NOT_PRESENT)
    {
        SdStatus = SD_NOT_PRESENT;
        return MSD_ERROR;
    }
    else
    {
        SdStatus = SD_PRESENT;
    }

    /* SD initialized and set to SPI mode properly */
    return (SD_GoIdleState());
}

/**
 * @brief  Detects if SD card is correctly plugged in the memory slot or not.
 * @retval Returns if SD is detected or not
 */
uint8_t BSP_SD_IsDetected(void)
{
    uint8_t status = SD_PRESENT;

    /* Check SD card detect pin */
    if(HAL_GPIO_ReadPin(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) != GPIO_PIN_RESET)
    {
        status = SD_NOT_PRESENT;
    }

    return status;
}

/**
  * @brief  Returns information about specific card.
  * @param  pCardInfo: Pointer to a SD_CardInfo structure that contains all SD
  *         card information.
  * @retval The SD Response:
  *         - MSD_ERROR: Sequence failed
  *         - MSD_OK: Sequence succeed
  */
uint8_t BSP_SD_GetCardInfo(SD_CardInfo *pCardInfo)
{
    uint8_t status;

    status = SD_GetCSDRegister(&(pCardInfo->Csd));
    status|= SD_GetCIDRegister(&(pCardInfo->Cid));
    if(flag_SDHC == 1 )
    {
    pCardInfo->LogBlockSize = 512;
        pCardInfo->CardBlockSize = 512;
    pCardInfo->CardCapacity = (pCardInfo->Csd.version.v2.DeviceSize + 1) * 1024 * pCardInfo->LogBlockSize;
    pCardInfo->LogBlockNbr = (pCardInfo->CardCapacity) / (pCardInfo->LogBlockSize);
    }
    else
    {
        pCardInfo->CardCapacity = (pCardInfo->Csd.version.v1.DeviceSize + 1) ;
        pCardInfo->CardCapacity *= (1 << (pCardInfo->Csd.version.v1.DeviceSizeMul + 2));
    pCardInfo->LogBlockSize = 512;
        pCardInfo->CardBlockSize = 1 << (pCardInfo->Csd.RdBlockLen);
        pCardInfo->CardCapacity *= pCardInfo->CardBlockSize;
    pCardInfo->LogBlockNbr = (pCardInfo->CardCapacity) / (pCardInfo->LogBlockSize);
    }

    return status;
}

/**
  * @brief  Reads block(s) from a specified address in the SD card, in polling mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  ReadAddr: Address from where data is to be read. The address is counted
  *                   in blocks of 512bytes
  * @param  NumOfBlocks: Number of SD blocks to read
  * @param  Timeout: This parameter is used for compatibility with BSP implementation
  * @retval SD status
  */
uint8_t BSP_SD_ReadBlocks(uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks, uint32_t Timeout)
{
    uint32_t offset = 0;
  uint32_t addr;
  uint8_t retr = BSP_SD_ERROR;
    uint8_t *ptr = NULL;
    SD_CmdAnswer_typedef response;
  uint16_t BlockSize = 512;

    /* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
       Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
    response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);
    SD_IO_CSState(1);
    SD_IO_WriteByte(SD_DUMMY_BYTE);
    if ( response.r1 != SD_R1_NO_ERROR)
    {
        goto error;
    }

    ptr = malloc(sizeof(uint8_t)*BlockSize);
    if( ptr == NULL )
    {
        goto error;
    }
    memset(ptr, SD_DUMMY_BYTE, sizeof(uint8_t)*BlockSize);

  /* Initialize the address */
  addr = (ReadAddr * ((flag_SDHC == 1) ? 1 : BlockSize));

    /* Data transfer */
  while (NumOfBlocks--)
    {
        /* Send CMD17 (SD_CMD_READ_SINGLE_BLOCK) to read one block */
        /* Check if the SD acknowledged the read block command: R1 response (0x00: no errors) */
    response = SD_SendCmd(SD_CMD_READ_SINGLE_BLOCK, addr, 0xFF, SD_ANSWER_R1_EXPECTED);
        if ( response.r1 != SD_R1_NO_ERROR)
        {
            goto error;
        }

        /* Now look for the data token to signify the start of the data */
        if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == MSD_OK)
        {
            /* Read the SD block data : read NumByteToRead data */
            SD_IO_WriteReadData(ptr, (uint8_t*)pData + offset, BlockSize);

            /* Set next read address*/
            offset += BlockSize;
      addr = ((flag_SDHC == 1) ? (addr + 1) : (addr + BlockSize));

            /* get CRC bytes (not really needed by us, but required by SD) */
            SD_IO_WriteByte(SD_DUMMY_BYTE);
            SD_IO_WriteByte(SD_DUMMY_BYTE);
        }
        else
        {
            goto error;
        }

        /* End the command data read cycle */
        SD_IO_CSState(1);
        SD_IO_WriteByte(SD_DUMMY_BYTE);
    }

    retr = MSD_OK;

error :
    /* Send dummy byte: 8 Clock pulses of delay */
    SD_IO_CSState(1);
    SD_IO_WriteByte(SD_DUMMY_BYTE);
    if(ptr != NULL) free(ptr);

    /* Return the response */
    return retr;
}

/**
  * @brief  Writes block(s) to a specified address in the SD card, in polling mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be written. The address is counted
  *                   in blocks of 512bytes
  * @param  NumOfBlocks: Number of SD blocks to write
  * @param  Timeout: This parameter is used for compatibility with BSP implementation
  * @retval SD status
  */
uint8_t BSP_SD_WriteBlocks(uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks, uint32_t Timeout)
{
    uint32_t offset = 0;
    uint32_t addr;
    uint8_t retr = BSP_SD_ERROR;
    uint8_t *ptr = NULL;
    SD_CmdAnswer_typedef response;
  uint16_t BlockSize = 512;

    /* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
       Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
    response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);
    SD_IO_CSState(1);
    SD_IO_WriteByte(SD_DUMMY_BYTE);
    if ( response.r1 != SD_R1_NO_ERROR)
    {
        goto error;
    }

    ptr = malloc(sizeof(uint8_t)*BlockSize);
    if (ptr == NULL)
    {
        goto error;
    }

