STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_sd.c
        /* Set CS High */
        SD_IO_CSState(1);
        /* Set CS Low */
        SD_IO_CSState(0);

        /* Wait IO line return 0xFF */
        while (SD_IO_WriteByte(SD_DUMMY_BYTE) != 0xFF);
        break;
    case SD_DATA_CRC_ERROR:
        rvalue =  SD_DATA_CRC_ERROR;
        break;
    case SD_DATA_WRITE_ERROR:
        rvalue = SD_DATA_WRITE_ERROR;
        break;
    default:
        break;
    }

    /* Return response */
    return rvalue;
}


/**
  * @brief  Put the SD in Idle state.
  * @retval SD status
  */
uint8_t SD_GoIdleState(void)
{
    SD_CmdAnswer_typedef response;
    __IO uint8_t counter = 0;
    /* Send CMD0 (SD_CMD_GO_IDLE_STATE) to put SD in SPI mode and
       wait for In Idle State Response (R1 Format) equal to 0x01 */
    do {
        counter++;
        response = SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0, 0x95, SD_ANSWER_R1_EXPECTED);
        SD_IO_CSState(1);
        SD_IO_WriteByte(SD_DUMMY_BYTE);
        if(counter >= SD_MAX_TRY)
        {
            return BSP_SD_ERROR;
        }
    }
    while(response.r1 != SD_R1_IN_IDLE_STATE);


    /* Send CMD8 (SD_CMD_SEND_IF_COND) to check the power supply status
       and wait until response (R7 Format) equal to 0xAA and */
    response = SD_SendCmd(SD_CMD_SEND_IF_COND, 0x1AA, 0x87, SD_ANSWER_R7_EXPECTED);
    SD_IO_CSState(1);
    SD_IO_WriteByte(SD_DUMMY_BYTE);
    if((response.r1  & SD_R1_ILLEGAL_COMMAND) == SD_R1_ILLEGAL_COMMAND)
    {
        /* initialise card V1 */
        do
        {
            /* initialise card V1 */
            /* Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors) */
            response = SD_SendCmd(SD_CMD_APP_CMD, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);
            SD_IO_CSState(1);
            SD_IO_WriteByte(SD_DUMMY_BYTE);

            /* Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors) */
            response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);
            SD_IO_CSState(1);
            SD_IO_WriteByte(SD_DUMMY_BYTE);
        }
        while(response.r1 == SD_R1_IN_IDLE_STATE);
        flag_SDHC = 0;
    }
    else if(response.r1 == SD_R1_IN_IDLE_STATE)
    {
        /* initialise card V2 */
        do {

            /* Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors) */
            response = SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
            SD_IO_CSState(1);
            SD_IO_WriteByte(SD_DUMMY_BYTE);

            /* Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors) */
            response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x40000000, 0xFF, SD_ANSWER_R1_EXPECTED);
            SD_IO_CSState(1);
            SD_IO_WriteByte(SD_DUMMY_BYTE);
        }
        while(response.r1 == SD_R1_IN_IDLE_STATE);

        if((response.r1 & SD_R1_ILLEGAL_COMMAND) == SD_R1_ILLEGAL_COMMAND)
        {
            do {
                /* Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors) */
                response = SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
                SD_IO_CSState(1);
                SD_IO_WriteByte(SD_DUMMY_BYTE);
                if(response.r1 != SD_R1_IN_IDLE_STATE)
                {
                    return BSP_SD_ERROR;
                }
                /* Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors) */
                response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);
                SD_IO_CSState(1);
                SD_IO_WriteByte(SD_DUMMY_BYTE);
            }
            while(response.r1 == SD_R1_IN_IDLE_STATE);
        }

        /* Send CMD58 (SD_CMD_READ_OCR) to initialize SDHC or SDXC cards: R3 response (0x00: no errors) */
        response = SD_SendCmd(SD_CMD_READ_OCR, 0x00000000, 0xFF, SD_ANSWER_R3_EXPECTED);
        SD_IO_CSState(1);
        SD_IO_WriteByte(SD_DUMMY_BYTE);
        if(response.r1 != SD_R1_NO_ERROR)
        {
            return BSP_SD_ERROR;
        }
        flag_SDHC = (response.r2 & 0x40) >> 6;
    }
    else
    {
        return BSP_SD_ERROR;
    }

    return MSD_OK;
}

/**
  * @brief  Waits a data until a value different from SD_DUMMY_BITE
  * @retval the value read
  */
uint8_t SD_ReadData(void)
{
    uint8_t timeout = 0x08;
    uint8_t readvalue;

    /* Check if response is got or a timeout is happen */
    do {
        readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
        timeout--;

    } while ((readvalue == SD_DUMMY_BYTE) && timeout);

    /* Right response got */
    return readvalue;
}

/**
  * @brief  Waits a data from the SD card
  * @param  data : Expected data from the SD card
  * @retval MSD_OK or BSP_SD_TIMEOUT
  */
uint8_t SD_WaitData(uint8_t data)
{
    uint16_t timeout = 0xFFFF;
    uint8_t readvalue;

    /* Check if response is got or a timeout is happen */

    do {
        readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
        timeout--;
    } while ((readvalue != data) && timeout);

    if (timeout == 0)
    {
        /* After time out */
        return BSP_SD_TIMEOUT;
    }

    /* Right response got */
    return MSD_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
